<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"b2b0ca09cf289ee2227925ee4f29f762feb1c2d241a011ae887b1d3721136601","plan_job_ref":"Job Test plan target and replace #378 at https://github.com/dflook/terraform-github-actions/actions/runs/7173868394","plan_hash":"0d8ffa7bced6fba5c8bf42e8d377b63ecd9ea4e7756cdaf04f686e39b80cd5e1","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "9fxqJoDFbL" -> (known after apply)
!~  foreach = "xquoVpY6oD" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #378](https://github.com/dflook/terraform-github-actions/actions/runs/7173868394)